{"class_name": "Model", "backend": "tensorflow", "config": {"name": "anon", "layers": [{"name": "input_9", "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "name": "input_9", "batch_input_shape": [null, 2, 128, 1]}, "inbound_nodes": []}, {"name": "Enc", "class_name": "Model", "config": {"name": "Enc", "layers": [{"name": "input_7", "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "name": "input_7", "batch_input_shape": [null, 2, 128, 1]}, "inbound_nodes": []}, {"name": "conv2d_20", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "trainable": true, "use_bias": true, "filters": 100, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_20", "bias_regularizer": null, "kernel_size": [1, 3], "activation": "selu"}, "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "center": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "axis": -1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_9", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"name": "conv2d_21", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "trainable": true, "use_bias": true, "filters": 100, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_21", "bias_regularizer": null, "kernel_size": [1, 3], "activation": "selu"}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "center": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "axis": -1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_10", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"name": "max_pooling2d_13", "class_name": "MaxPooling2D", "config": {"strides": [1, 2], "pool_size": [1, 2], "padding": "valid", "name": "max_pooling2d_13", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "conv2d_22", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "trainable": true, "use_bias": true, "filters": 100, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_22", "bias_regularizer": null, "kernel_size": [1, 3], "activation": "selu"}, "inbound_nodes": [[["max_pooling2d_13", 0, 0, {}]]]}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "center": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "axis": -1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_11", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"name": "max_pooling2d_14", "class_name": "MaxPooling2D", "config": {"strides": [1, 2], "pool_size": [1, 2], "padding": "valid", "name": "max_pooling2d_14", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"name": "conv2d_23", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "trainable": true, "use_bias": true, "filters": 100, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_23", "bias_regularizer": null, "kernel_size": [1, 3], "activation": "selu"}, "inbound_nodes": [[["max_pooling2d_14", 0, 0, {}]]]}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "center": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "axis": -1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_12", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"name": "Encoder", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "kernel_regularizer": null, "trainable": true, "use_bias": true, "filters": 1, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "Encoder", "bias_regularizer": null, "kernel_size": [1, 3], "activation": "linear"}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "center": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "axis": -1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_13", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["Encoder", 0, 0, {}]]]}], "output_layers": [["batch_normalization_13", 0, 0]], "input_layers": [["input_7", 0, 0]]}, "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"name": "Dec", "class_name": "Model", "config": {"name": "Dec", "layers": [{"name": "input_8", "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "name": "input_8", "batch_input_shape": [null, 2, 32, 1]}, "inbound_nodes": []}, {"name": "conv2d_transpose_5", "class_name": "Conv2DTranspose", "config": {"strides": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "kernel_size": [1, 3], "use_bias": true, "filters": 100, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_transpose_5", "output_padding": null, "trainable": true, "activation": "selu"}, "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "center": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "axis": -1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_14", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_transpose_5", 0, 0, {}]]]}, {"name": "conv2d_transpose_6", "class_name": "Conv2DTranspose", "config": {"strides": [1, 2], "padding": "same", "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "kernel_size": [1, 3], "use_bias": true, "filters": 100, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_transpose_6", "output_padding": null, "trainable": true, "activation": "selu"}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "center": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "axis": -1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_15", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_transpose_6", 0, 0, {}]]]}, {"name": "conv2d_transpose_7", "class_name": "Conv2DTranspose", "config": {"strides": [1, 2], "padding": "same", "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "kernel_size": [1, 3], "use_bias": true, "filters": 100, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_transpose_7", "output_padding": null, "trainable": true, "activation": "selu"}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"name": "batch_normalization_16", "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "center": true, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "scale": true, "axis": -1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_16", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_transpose_7", 0, 0, {}]]]}, {"name": "conv2d_transpose_8", "class_name": "Conv2DTranspose", "config": {"strides": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "kernel_size": [1, 3], "use_bias": true, "filters": 100, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_transpose_8", "output_padding": null, "trainable": true, "activation": "selu"}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"name": "Decoder", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "kernel_regularizer": null, "trainable": true, "use_bias": true, "filters": 1, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "Decoder", "bias_regularizer": null, "kernel_size": [1, 3], "activation": "linear"}, "inbound_nodes": [[["conv2d_transpose_8", 0, 0, {}]]]}], "output_layers": [["Decoder", 0, 0]], "input_layers": [["input_8", 0, 0]]}, "inbound_nodes": [[["Enc", 1, 0, {}]]]}, {"name": "ENC_ID", "class_name": "Model", "config": {"name": "ENC_ID", "layers": [{"name": "input_4", "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "name": "input_4", "batch_input_shape": [null, 2, 32, 1]}, "inbound_nodes": []}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "trainable": true, "use_bias": true, "filters": 32, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_5", "bias_regularizer": null, "kernel_size": [2, 5], "activation": "relu"}, "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "trainable": true, "use_bias": true, "filters": 32, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_6", "bias_regularizer": null, "kernel_size": [2, 5], "activation": "relu"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "trainable": true, "use_bias": true, "filters": 32, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_7", "bias_regularizer": null, "kernel_size": [2, 5], "activation": "relu"}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"strides": [1, 2], "pool_size": [1, 2], "padding": "valid", "name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "dropout_3", "class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"name": "conv2d_8", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "trainable": true, "use_bias": true, "filters": 32, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_8", "bias_regularizer": null, "kernel_size": [2, 5], "activation": "relu"}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"name": "dropout_4", "class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "conv2d_9", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "trainable": true, "use_bias": true, "filters": 32, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_9", "bias_regularizer": null, "kernel_size": [2, 5], "activation": "relu"}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"name": "max_pooling2d_4", "class_name": "MaxPooling2D", "config": {"strides": [1, 2], "pool_size": [1, 2], "padding": "valid", "name": "max_pooling2d_4", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "dropout_5", "class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "trainable": true, "use_bias": true, "units": 128, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "dense_1", "activation": "relu", "bias_regularizer": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "dropout_6", "class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "trainable": true, "use_bias": true, "units": 32, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "dense_2", "activation": "relu", "bias_regularizer": null}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}, {"name": "dropout_7", "class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "Identifier", "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "use_bias": true, "units": 24, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "Identifier", "activation": "softmax", "bias_regularizer": null}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]]}], "output_layers": [["Identifier", 0, 0]], "input_layers": [["input_4", 0, 0]]}, "inbound_nodes": [[["Enc", 1, 0, {}]]]}, {"name": "DEC_ID", "class_name": "Model", "config": {"name": "DEC_ID", "layers": [{"name": "input_5", "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "name": "input_5", "batch_input_shape": [null, 2, 128, 1]}, "inbound_nodes": []}, {"name": "conv2d_10", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "trainable": true, "use_bias": true, "filters": 32, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_10", "bias_regularizer": null, "kernel_size": [2, 5], "activation": "relu"}, "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"name": "dropout_8", "class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "trainable": true, "use_bias": true, "filters": 32, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_11", "bias_regularizer": null, "kernel_size": [2, 5], "activation": "relu"}, "inbound_nodes": [[["dropout_8", 0, 0, {}]]]}, {"name": "max_pooling2d_5", "class_name": "MaxPooling2D", "config": {"strides": [1, 2], "pool_size": [1, 2], "padding": "valid", "name": "max_pooling2d_5", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"name": "dropout_9", "class_name": "Dropout", "config": {"name": "dropout_9", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "trainable": true, "use_bias": true, "filters": 32, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_12", "bias_regularizer": null, "kernel_size": [2, 5], "activation": "relu"}, "inbound_nodes": [[["dropout_9", 0, 0, {}]]]}, {"name": "max_pooling2d_6", "class_name": "MaxPooling2D", "config": {"strides": [1, 2], "pool_size": [1, 2], "padding": "valid", "name": "max_pooling2d_6", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"name": "dropout_10", "class_name": "Dropout", "config": {"name": "dropout_10", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]]}, {"name": "conv2d_13", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "trainable": true, "use_bias": true, "filters": 32, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_13", "bias_regularizer": null, "kernel_size": [2, 5], "activation": "relu"}, "inbound_nodes": [[["dropout_10", 0, 0, {}]]]}, {"name": "max_pooling2d_7", "class_name": "MaxPooling2D", "config": {"strides": [1, 2], "pool_size": [1, 2], "padding": "valid", "name": "max_pooling2d_7", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"name": "dropout_11", "class_name": "Dropout", "config": {"name": "dropout_11", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling2d_7", 0, 0, {}]]]}, {"name": "conv2d_14", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "trainable": true, "use_bias": true, "filters": 32, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_14", "bias_regularizer": null, "kernel_size": [2, 5], "activation": "relu"}, "inbound_nodes": [[["dropout_11", 0, 0, {}]]]}, {"name": "max_pooling2d_8", "class_name": "MaxPooling2D", "config": {"strides": [1, 2], "pool_size": [1, 2], "padding": "valid", "name": "max_pooling2d_8", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"name": "dropout_12", "class_name": "Dropout", "config": {"name": "dropout_12", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling2d_8", 0, 0, {}]]]}, {"name": "flatten_2", "class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["dropout_12", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "trainable": true, "use_bias": true, "units": 256, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "dense_3", "activation": "relu", "bias_regularizer": null}, "inbound_nodes": [[["flatten_2", 0, 0, {}]]]}, {"name": "dropout_13", "class_name": "Dropout", "config": {"name": "dropout_13", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "trainable": true, "use_bias": true, "units": 64, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "dense_4", "activation": "relu", "bias_regularizer": null}, "inbound_nodes": [[["dropout_13", 0, 0, {}]]]}, {"name": "dropout_14", "class_name": "Dropout", "config": {"name": "dropout_14", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"name": "Identifier", "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "use_bias": true, "units": 24, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "Identifier", "activation": "softmax", "bias_regularizer": null}, "inbound_nodes": [[["dropout_14", 0, 0, {}]]]}], "output_layers": [["Identifier", 0, 0]], "input_layers": [["input_5", 0, 0]]}, "inbound_nodes": [[["Dec", 1, 0, {}]]]}, {"name": "ACT_ID", "class_name": "Model", "config": {"name": "ACT_ID", "layers": [{"name": "input_6", "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "name": "input_6", "batch_input_shape": [null, 2, 128, 1]}, "inbound_nodes": []}, {"name": "conv2d_15", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "trainable": true, "use_bias": true, "filters": 32, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_15", "bias_regularizer": null, "kernel_size": [2, 5], "activation": "relu"}, "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"name": "dropout_15", "class_name": "Dropout", "config": {"name": "dropout_15", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"name": "conv2d_16", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "trainable": true, "use_bias": true, "filters": 32, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_16", "bias_regularizer": null, "kernel_size": [2, 5], "activation": "relu"}, "inbound_nodes": [[["dropout_15", 0, 0, {}]]]}, {"name": "max_pooling2d_9", "class_name": "MaxPooling2D", "config": {"strides": [1, 2], "pool_size": [1, 2], "padding": "valid", "name": "max_pooling2d_9", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"name": "dropout_16", "class_name": "Dropout", "config": {"name": "dropout_16", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling2d_9", 0, 0, {}]]]}, {"name": "conv2d_17", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "trainable": true, "use_bias": true, "filters": 32, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_17", "bias_regularizer": null, "kernel_size": [2, 5], "activation": "relu"}, "inbound_nodes": [[["dropout_16", 0, 0, {}]]]}, {"name": "max_pooling2d_10", "class_name": "MaxPooling2D", "config": {"strides": [1, 2], "pool_size": [1, 2], "padding": "valid", "name": "max_pooling2d_10", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"name": "dropout_17", "class_name": "Dropout", "config": {"name": "dropout_17", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling2d_10", 0, 0, {}]]]}, {"name": "conv2d_18", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "trainable": true, "use_bias": true, "filters": 32, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_18", "bias_regularizer": null, "kernel_size": [2, 5], "activation": "relu"}, "inbound_nodes": [[["dropout_17", 0, 0, {}]]]}, {"name": "max_pooling2d_11", "class_name": "MaxPooling2D", "config": {"strides": [1, 2], "pool_size": [1, 2], "padding": "valid", "name": "max_pooling2d_11", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"name": "dropout_18", "class_name": "Dropout", "config": {"name": "dropout_18", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling2d_11", 0, 0, {}]]]}, {"name": "conv2d_19", "class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "trainable": true, "use_bias": true, "filters": 32, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "conv2d_19", "bias_regularizer": null, "kernel_size": [2, 5], "activation": "relu"}, "inbound_nodes": [[["dropout_18", 0, 0, {}]]]}, {"name": "max_pooling2d_12", "class_name": "MaxPooling2D", "config": {"strides": [1, 2], "pool_size": [1, 2], "padding": "valid", "name": "max_pooling2d_12", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"name": "dropout_19", "class_name": "Dropout", "config": {"name": "dropout_19", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling2d_12", 0, 0, {}]]]}, {"name": "flatten_3", "class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["dropout_19", 0, 0, {}]]]}, {"name": "dense_5", "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "trainable": true, "use_bias": true, "units": 256, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "dense_5", "activation": "relu", "bias_regularizer": null}, "inbound_nodes": [[["flatten_3", 0, 0, {}]]]}, {"name": "dropout_20", "class_name": "Dropout", "config": {"name": "dropout_20", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"name": "dense_6", "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "trainable": true, "use_bias": true, "units": 64, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "dense_6", "activation": "relu", "bias_regularizer": null}, "inbound_nodes": [[["dropout_20", 0, 0, {}]]]}, {"name": "dropout_21", "class_name": "Dropout", "config": {"name": "dropout_21", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_6", 0, 0, {}]]]}, {"name": "Identifier", "class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "use_bias": true, "units": 4, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "name": "Identifier", "activation": "softmax", "bias_regularizer": null}, "inbound_nodes": [[["dropout_21", 0, 0, {}]]]}], "output_layers": [["Identifier", 0, 0]], "input_layers": [["input_6", 0, 0]]}, "inbound_nodes": [[["Dec", 1, 0, {}]]]}], "output_layers": [["Dec", 1, 0], ["ENC_ID", 1, 0], ["DEC_ID", 1, 0], ["ACT_ID", 1, 0]], "input_layers": [["input_9", 0, 0]]}, "keras_version": "2.2.2"}