{"config": {"input_layers": [["input_8", 0, 0]], "output_layers": [["Decoder", 1, 0], ["EncReg", 1, 0], ["ActReg", 1, 0]], "name": "anon", "layers": [{"config": {"batch_input_shape": [null, 2, 128, 1], "name": "input_8", "dtype": "float32", "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_8"}, {"config": {"input_layers": [["input_6", 0, 0]], "output_layers": [["batch_normalization_11", 0, 0]], "name": "Encoder", "layers": [{"config": {"batch_input_shape": [null, 2, 128, 1], "name": "input_6", "dtype": "float32", "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_6"}, {"config": {"padding": "same", "filters": 64, "name": "conv2d_16", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "strides": [1, 1], "kernel_size": [2, 5], "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "data_format": "channels_last", "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["input_6", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_16"}, {"config": {"momentum": 0.99, "name": "batch_normalization_8", "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "scale": true, "trainable": true}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_8"}, {"config": {"padding": "same", "filters": 64, "name": "conv2d_17", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "strides": [1, 1], "kernel_size": [2, 5], "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "data_format": "channels_last", "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_17"}, {"config": {"momentum": 0.99, "name": "batch_normalization_9", "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "scale": true, "trainable": true}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_9"}, {"config": {"padding": "valid", "pool_size": [1, 2], "name": "max_pooling2d_7", "strides": [1, 2], "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_7"}, {"config": {"padding": "same", "filters": 64, "name": "conv2d_18", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "strides": [1, 1], "kernel_size": [2, 5], "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "data_format": "channels_last", "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["max_pooling2d_7", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_18"}, {"config": {"momentum": 0.99, "name": "batch_normalization_10", "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "scale": true, "trainable": true}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_10"}, {"config": {"padding": "valid", "pool_size": [1, 2], "name": "max_pooling2d_8", "strides": [1, 2], "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_8"}, {"config": {"padding": "same", "filters": 1, "name": "conv2d_19", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "strides": [1, 1], "kernel_size": [2, 5], "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["max_pooling2d_8", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_19"}, {"config": {"momentum": 0.99, "name": "batch_normalization_11", "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "scale": true, "trainable": true}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_11"}]}, "inbound_nodes": [[["input_8", 0, 0, {}]]], "class_name": "Model", "name": "Encoder"}, {"config": {"input_layers": [["input_7", 0, 0]], "output_layers": [["conv2d_20", 0, 0]], "name": "Decoder", "layers": [{"config": {"batch_input_shape": [null, 2, 32, 1], "name": "input_7", "dtype": "float32", "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_7"}, {"config": {"padding": "same", "filters": 64, "name": "conv2d_transpose_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "output_padding": null, "strides": [1, 1], "kernel_size": [2, 5], "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "data_format": "channels_last", "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["input_7", 0, 0, {}]]], "class_name": "Conv2DTranspose", "name": "conv2d_transpose_4"}, {"config": {"momentum": 0.99, "name": "batch_normalization_12", "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "scale": true, "trainable": true}, "inbound_nodes": [[["conv2d_transpose_4", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_12"}, {"config": {"padding": "same", "filters": 64, "name": "conv2d_transpose_5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "output_padding": null, "strides": [1, 2], "kernel_size": [2, 5], "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "data_format": "channels_last", "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "class_name": "Conv2DTranspose", "name": "conv2d_transpose_5"}, {"config": {"momentum": 0.99, "name": "batch_normalization_13", "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "scale": true, "trainable": true}, "inbound_nodes": [[["conv2d_transpose_5", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_13"}, {"config": {"padding": "same", "filters": 64, "name": "conv2d_transpose_6", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "output_padding": null, "strides": [1, 2], "kernel_size": [2, 5], "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "data_format": "channels_last", "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "class_name": "Conv2DTranspose", "name": "conv2d_transpose_6"}, {"config": {"momentum": 0.99, "name": "batch_normalization_14", "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "scale": true, "trainable": true}, "inbound_nodes": [[["conv2d_transpose_6", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_14"}, {"config": {"padding": "same", "filters": 1, "name": "conv2d_20", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "strides": [1, 1], "kernel_size": [2, 5], "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_20"}]}, "inbound_nodes": [[["Encoder", 1, 0, {}]]], "class_name": "Model", "name": "Decoder"}, {"config": {"input_layers": [["input_4", 0, 0]], "output_layers": [["dense_3", 0, 0]], "name": "EncReg", "layers": [{"config": {"batch_input_shape": [null, 2, 32, 1], "name": "input_4", "dtype": "float32", "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_4"}, {"config": {"padding": "same", "filters": 32, "name": "conv2d_6", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "strides": [1, 1], "kernel_size": [2, 3], "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "data_format": "channels_last", "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["input_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_6"}, {"config": {"noise_shape": null, "seed": null, "rate": 0.25, "name": "dropout_1", "trainable": true}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_1"}, {"config": {"padding": "same", "filters": 32, "name": "conv2d_7", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "strides": [1, 1], "kernel_size": [2, 3], "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "data_format": "channels_last", "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_7"}, {"config": {"padding": "valid", "pool_size": [1, 2], "name": "max_pooling2d_3", "strides": [1, 2], "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_3"}, {"config": {"noise_shape": null, "seed": null, "rate": 0.25, "name": "dropout_2", "trainable": true}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_2"}, {"config": {"padding": "same", "filters": 32, "name": "conv2d_8", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "strides": [1, 1], "kernel_size": [2, 3], "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "data_format": "channels_last", "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_8"}, {"config": {"noise_shape": null, "seed": null, "rate": 0.25, "name": "dropout_3", "trainable": true}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_3"}, {"config": {"padding": "same", "filters": 32, "name": "conv2d_9", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "strides": [1, 1], "kernel_size": [2, 3], "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "data_format": "channels_last", "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_9"}, {"config": {"noise_shape": null, "seed": null, "rate": 0.25, "name": "dropout_4", "trainable": true}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_4"}, {"config": {"padding": "same", "filters": 32, "name": "conv2d_10", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "strides": [1, 1], "kernel_size": [2, 3], "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "data_format": "channels_last", "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_10"}, {"config": {"padding": "valid", "pool_size": [1, 2], "name": "max_pooling2d_4", "strides": [1, 2], "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_4"}, {"config": {"noise_shape": null, "seed": null, "rate": 0.25, "name": "dropout_5", "trainable": true}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_5"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_1"}, {"config": {"name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 64, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_1"}, {"config": {"noise_shape": null, "seed": null, "rate": 0.5, "name": "dropout_6", "trainable": true}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_6"}, {"config": {"name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 16, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "class_name": "Dense", "name": "dense_2"}, {"config": {"noise_shape": null, "seed": null, "rate": 0.5, "name": "dropout_7", "trainable": true}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_7"}, {"config": {"name": "dense_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "activation": "softmax", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 24, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "class_name": "Dense", "name": "dense_3"}]}, "inbound_nodes": [[["Encoder", 1, 0, {}]]], "class_name": "Model", "name": "EncReg"}, {"config": {"input_layers": [["input_5", 0, 0]], "output_layers": [["dense_6", 0, 0]], "name": "ActReg", "layers": [{"config": {"batch_input_shape": [null, 2, 32, 1], "name": "input_5", "dtype": "float32", "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_5"}, {"config": {"padding": "same", "filters": 32, "name": "conv2d_11", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "strides": [1, 1], "kernel_size": [2, 5], "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "data_format": "channels_last", "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["input_5", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_11"}, {"config": {"noise_shape": null, "seed": null, "rate": 0.25, "name": "dropout_8", "trainable": true}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_8"}, {"config": {"padding": "same", "filters": 32, "name": "conv2d_12", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "strides": [1, 1], "kernel_size": [2, 5], "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "data_format": "channels_last", "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["dropout_8", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_12"}, {"config": {"padding": "valid", "pool_size": [1, 2], "name": "max_pooling2d_5", "strides": [1, 2], "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_5"}, {"config": {"noise_shape": null, "seed": null, "rate": 0.25, "name": "dropout_9", "trainable": true}, "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_9"}, {"config": {"padding": "same", "filters": 32, "name": "conv2d_13", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "strides": [1, 1], "kernel_size": [2, 5], "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "data_format": "channels_last", "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["dropout_9", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_13"}, {"config": {"noise_shape": null, "seed": null, "rate": 0.25, "name": "dropout_10", "trainable": true}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_10"}, {"config": {"padding": "same", "filters": 32, "name": "conv2d_14", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "strides": [1, 1], "kernel_size": [2, 5], "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "data_format": "channels_last", "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["dropout_10", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_14"}, {"config": {"noise_shape": null, "seed": null, "rate": 0.25, "name": "dropout_11", "trainable": true}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_11"}, {"config": {"padding": "same", "filters": 32, "name": "conv2d_15", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "strides": [1, 1], "kernel_size": [2, 5], "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "data_format": "channels_last", "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["dropout_11", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_15"}, {"config": {"padding": "valid", "pool_size": [1, 2], "name": "max_pooling2d_6", "strides": [1, 2], "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_6"}, {"config": {"noise_shape": null, "seed": null, "rate": 0.25, "name": "dropout_12", "trainable": true}, "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_12"}, {"config": {"data_format": "channels_last", "name": "flatten_2", "trainable": true}, "inbound_nodes": [[["dropout_12", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_2"}, {"config": {"name": "dense_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 64, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "class_name": "Dense", "name": "dense_4"}, {"config": {"noise_shape": null, "seed": null, "rate": 0.5, "name": "dropout_13", "trainable": true}, "inbound_nodes": [[["dense_4", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_13"}, {"config": {"name": "dense_5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 16, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["dropout_13", 0, 0, {}]]], "class_name": "Dense", "name": "dense_5"}, {"config": {"noise_shape": null, "seed": null, "rate": 0.5, "name": "dropout_14", "trainable": true}, "inbound_nodes": [[["dense_5", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_14"}, {"config": {"name": "dense_6", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "activation": "softmax", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 4, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["dropout_14", 0, 0, {}]]], "class_name": "Dense", "name": "dense_6"}]}, "inbound_nodes": [[["Encoder", 1, 0, {}]]], "class_name": "Model", "name": "ActReg"}]}, "class_name": "Model", "keras_version": "2.2.4", "backend": "tensorflow"}